<?php
/**
 * @package 7th March Speech - Bangla
 * @version 1.0
 */
/*
Plugin Name: সাতই মার্চের ভাষণ
Plugin URI: N/A
Description: একটি বিখ্যাত ওয়ার্ডপ্রেস প্লাগইন হ্যালো ডলির উপর ভিত্তি করে, বঙ্গবন্ধু শেখ মুজিবুর রহমানের ঐতিহাসিক ভাষণ, যা ছিল বাংলাদেশের স্বাধীনতার একটি প্রকৃত ঘোষণা।
Author: এহসানুর রহমান রিদম
Version: 1.0
Author URI: http://errhythm.me
*/

function Bangabandhu_get_7th_March_speech() {
	/** These are the speech to Hello Dolly */
	$speech = "আজ দুঃখ-ভারাক্রান্ত মন নিয়ে আপনাদের সামনে হাজির হয়েছি। 
আপনারা সবই জানেন এবং বুঝেন। 
আমরা আমাদের জীবন দিয়ে চেষ্টা করেছি- আজ ঢাকা, চট্টগ্রাম, রংপুর ও যশোরের রাজপথ আমার ভাইয়ের রক্তে রঞ্জিত হয়েছে।
আজ বাংলার মানুষ মুক্তি চায়-তারা বাঁচতে চায়। 
তারা অধিকার পেতে চায়। 
নির্বাচনে আপনারা সম্পূর্ণভাবে আমাকে এবং আওয়ামী লীগকে ভোট দিয়ে জয়যুক্ত করেছেন শাসনতন্ত্র রচনার জন্য। 
আশা ছিল জাতীয় পরিষদ বসবে, আমরা শাসনতন্ত্র তৈরী করবো এবং এই শাসনতন্ত্রে মানুষ তাদের অর্থনৈতিক, রাজনৈতিক ও সাংস্কৃতিক মুক্তি লাভ করবে।
কিন্তু ২৩ বছরের ইতিহাস বাংলার মানুষের রক্ত দিয়ে রাজপথ রঞ্জিত করার ইতিহাস। 
২৩ বছরের ইতিহাস বাংলার মানুষের মুমুর্ষু আর্তনাদের ইতিহাস, রক্ত দানের করুণ ইতিহাস। নির্যাতিত মানুষের কান্নার ইতিহাস।
১৯৫২ সালে আমরা রক্ত দিয়েছি। ১৯৫৪ সালে নির্বাচনে জয় লাভ করেও ক্ষমতায় বসতে পারিনি। 
১৯৫৮ সালে দেশে সামরিক শাসন জারি করে আইয়ুব খান দশ বছর আমাদের গোলাম করে রাখলো। 
১৯৬৬ সালে ৬-দফা দেয়া হলো এবং এর পর এ অপরাধে আমার বহু ভাইকে হত্যা করা হলো। 
১৯৬৯ সালে গণ-আন্দোলনের মুখে আইয়ুবের পতনের পর ইয়াহিয়া খান এলেন। 
তিনি বলেলেন, তিনি জনগণের হাতে ক্ষমতা ফিরিয়ে দেবেন, শাসনতন্ত্র দেবেন, আমরা মেনে নিলাম।
তার পরের ঘটনা সকলেই জানেন। ইয়াহিয়া খানের সংগে আলোচনা হলো-আমরা তাকে ১৫ ইং ফেব্রুয়ারী জাতীয় পরিষদের অধিবেশন ডাকার অনুরোধ করলাম। 
কিন্তু 'মেজরিটি' পার্টির নেতা হওয়া সত্ত্বেও তিনি আমার কথা শুনলেন না। শুনলেন সংখ্যালঘু দলের ভুট্টো সাহেবের কথা। 
আমি শুধু বাংলার মেজরিটি পার্টির নেতা নই, সমগ্র পাকিস্তানের মেজরিটি পার্টির নেতা। ভুট্টো সাহেব বললেন, মার্চের প্রথম সপ্তাহে অধিবেশন ডাকতে, তিনি মার্চের ৩ তারিখে অধিবেশন ডাকলেন।
আমি বললাম, তবুও আমরা জাতীয় পরিষদের অধিবেশনে যাব এবং সংখ্যাগরিষ্ঠ দল হওয়া সত্বেও কেউ যদি ন্যায্য কথা বলে আমরা তা মেনে নেব, এমনকি তিনি যদি একজনও হন।
জনাব ভুট্টো ঢাকা এসেছিলেন। তাঁর সঙ্গে আলোচনা হলো। 
ভুট্টো সাহেব বলে গেছেন আলোচনার দরজা বন্ধ নয়; আরো আলোচনা হবে। 
মওলানা নুরানী ও মুফতি মাহুমুদ সহ পশ্চিম পাকিস্তানের অন্যান্য পার্লামেন্টারী নেতা এলেন, তাদের সঙ্গে আলোচনা হলো- উদ্দেশ্য ছিলো আলাপ-আলোচনা করে শাসনতন্ত্র রচনা করবো। 
তবে তাদের আমি জানিয়ে দিয়েছি ৬-দফা পরিবর্তনের কোন অধিকার আমার নেই, এটা জনগণের সম্পদ।
কিন্তু ভুট্টো হুমকি দিলেন। তিনি বললেন, এখানে এসে 'ডবল জিম্মী' হতে পারবেন না। পরিষদ কসাই খানায় পরিণত হবে। 
তিনি পশ্চিম পাকিস্তানী সদস্যদের প্রতি হুমকি দিলেন যে, পরিষদের অধিবেশনে যোগ দিলে রক্তপাত করা হবে, তাদের মাথা ভেঙে দেয়া হবে। হত্যা করা হবে। 
আন্দোলন শুরু হবে পেশোয়ার থেকে করাচী পর্যন্ত। একটি দোকানও খুলতে দেয়া হবে না।
তা সত্বেও পয়ত্রিশ জন পশ্চিম পাকিস্তানী সদস্য এলেন। কিন্ত পয়লা মার্চ ইয়াহিয়া খান পরিষদের অধিবেশন বন্ধ করে দিলেন। 
দোষ দেয়া হলো, বাংলার মানুষকে, দোষ দেয়া হলো আমাকে, বলা হলো আমার অনমনীয় মনোভাবের জন্যই কিছু হয়নি।
এরপর বাংলার মানুষ প্রতিবাদ মুখর হয়ে উঠলো। 
আমি শান্তিপূর্ণ সংগ্রাম চালিয়ে যাবার জন্য হরতাল ডাকলাম। জনগণ আপন ইচ্ছায় পথে নেমে এলো।
কিন্তু কি পেলাম আমরা? বাংলার নিরস্ত্র জনগণের উপর অস্ত্র ব্যবহার করা হলো। আমাদের হাতে অস্ত্র নেই। 
কিন্তু আমরা পয়সা দিয়ে যে অস্ত্র কিনে দিয়েছি বহিঃশত্রুর হাত থেকে দেশকে রক্ষা করার জন্যে, আজ সে অস্ত্র ব্যবহার করা হচ্ছে আমার নিরীহ মানুষদের হত্যা করার জন্য। 
আমার দুঃখী জনতার উপর চলছে গুলী।
আমরা বাংলার সংখ্যাগরিষ্ঠ মানুষ যখনই দেশের শাসনভার গ্রহণ করতে চেয়েছি, তখনই ষড়যন্ত্র চলেছে-আমাদের উপর ঝাঁপিয়ে পড়েছে।
ইয়াহিয়া খান বলেছেন, আমি নাকি ১০ই মার্চ তারিখে গোলটেবিল বৈঠকে যোগদান করতে চেয়েছি, তাঁর সাথে টেলিফোন আমার আলাপ হয়েছে। 
আমি তাঁকে বলেছি আপনি দেশের প্রেসিডেণ্ট, ঢাকায় আসুন দেখুন আমার গরীব জনসাধারণকে কি ভাবে হত্যা করা হয়েছে, আমার মায়ের কোল খালি করা হয়েছে ।
আমি আগেই বলে দিয়েছি কোন গোলটেবিল বৈঠক হবে না। কিসের গোলটেবিল বৈঠক? কার গোলটেবিল বৈঠক? 
যারা আমার মা বোনের কোল শূন্য করেছে তাদের সাথে বসবো আমি গোলটেবিল বৈঠকে ?
তেসরা তারিখে পল্টনে আমি অসহযোগের আহবান জানালাম। 
বললাম, অফিস-আদালত, খাজনা-ট্যাক্স বন্ধ করুন।আপনারা মেনে নিলেন।
হঠাৎ আমার সঙ্গে বা আমাদের সঙ্গে আলোচনা না করে একজনের সঙ্গে পাঁচ ঘণ্টা বৈঠকের পর ইয়াহিয়া খান যে বক্তৃতা করেছেন, তাতে সমস্ত দোষ আমার ও বাংলার মানুষের উপর চাপিয়ে দিয়েছেন। 
দোষ করলেন ভুট্টো- কিন্তু গুলী করে মারা হলো আমার বাংলার মানুষকে। আমরা গুলী খাই, দোষ আমাদের- আমরা বুলেট খাই, দোষ আমাদের।
ইয়াহিয়া সাহেব অধিবেশন ডেকেছেন। কিন্ত আমার দাবী সামরিক আইন প্রত্যাহার করতে হবে, সেনাবাহিনীকে ব্যারাকে ফিরিয়ে নিতে হবে, হত্যার তদন্ত করতে হবে। 
তারপর বিবেচনা করে দেখবো পরিষদে বসবো কি বসনো না। এ দাবী মানার আগে পরিষদে বসার কোন প্রশ্নই ওঠে না, জনগণ আমাকে সে অধিকার দেয়নি।
রক্তের দাগ এখনো শুকায়নি, শহীদদের রক্ত মাড়িয়ে ২৫ তারিখে পরিষদে যোগ দিতে যাব না।
ভাইয়েরা, আমার উপর বিশ্বাস আছে? আমি প্রধানমন্ত্রীত্ব চাইনা, মানুষের অধিকার চাই। 
প্রধান মন্ত্রীত্বের লোভ দেখিয়ে আমাকে নিতে পারেনি, ফাঁসীর কাষ্ঠে ঝুলিয়ে নিতে পারেনি। 
আপনারা রক্ত দিয়ে আমাকে ষড়যন্ত্র মামলা থেকে মুক্ত করে এনেছিলেন। 
সেদিন এই রেসকোর্সে আমি বলেছিলাম, রক্তের ঋণ আমি রক্ত দিয়ে শোধ করবো; মনে আছে? 
আজো আমি রক্ত দিয়েই রক্তের ঋণ শোধ করতে প্রস্তুত।
আমি বলে দিতে চাই, আজ থেকে কোর্ট-কাচারী, হাইকোর্ট, সুপ্রীম কোর্ট, অফিস, আদালত, শিক্ষা প্রতিষ্ঠানসমুহ অনির্দিষ্ট-কালের জন্য বন্ধ থাকবে। 
কোন কর্মচারী অফিস যাবেন না। এ আমার নির্দেশ।
গরীবের যাতে কষ্ট না হয় তার জন্য রিক্সা চলবে, ট্রেন চলবে আর সব চলবে।
ট্রেন চলবে- তবে সেনাবাহিনী আনা-নেয়া করা যাবে না। করলে যদি কোন দূর্ঘটনা ঘটে তার জন্য আমি দায়ী থাকবো না।
সেক্রেটারীয়েট, সুপ্রীম কোর্ট, হাইকোর্ট জজকোর্ট সহ সরকারী, আধা-সরকারী এবং স্বায়ত্তশাসিত সংস্থাগুলো বন্ধ থাকবে। 
শুধু পূর্ব বাংলার আদান-প্রদানের ব্যাঙ্কগুলো দু-ঘন্টার জন্য খোলা থাকবে। পূর্ব বাংলা থেকে পশ্চিম পাকিস্তানে টাকা যেতে পারবেন না। 
টেলিগ্রাফ, টেলিফোন বাংলাদেশের মধ্যে চালু থাকবে। তবে, সাংবাদিকরা বহির্বিশ্বে সংবাদ পাঠাতে পারবেন।
এদেশের মানুষকে খতম করা হচ্ছে, বুঝে শুনে চলবেন। দরকার হলে সমস্ত চাকা বন্ধ করে দেয়া হবে।
আপনারা নির্ধারিত সময়ে বেতন নিয়ে আসবেন। যদি একটিও গুলী চলে তাহলে বাংলার ঘরে ঘরে দূর্গ গড়ে তুলবেন। 
যার যা আছে তাই নিয়ে শত্রুর মোকাবেলা করতে হবে। রাস্তা ঘাট বন্ধ করে দিতে হবে। আমরা তাদের ভাতে মারবো-পানিতে মারবো। 
হুকুম দিবার জন্য আমি যদি না থাকি, আমার সহকর্মীরা যদি না থাকেন, আপনারা আন্দোলন চালিয়ে যাবেন।
তোমরা আমার ভাই, তোমরা ব্যারাকে থাকো, কেউ কিছু বলবেনা। গুলী চালালে আর ভাল হবে না। 
সাত কোটি মানুষকে আর দাবীয়ে রাখতে পারবা না। বাঙ্গালী মরতেশিখেছে, তাদের কেউ দাবাতে পারবে না।
শহীদদের ও আহতদের পরিবারের জন্য আওয়ামী লীগ সাহায্যে কমিটি করেছে। আমরা সাহায্যের চেষ্টা করবো। আপনারা যে যা পারেন দিয়ে যাবেন।
সাত দিনের হরতালে যে সব শ্রমিক অংশ গ্রহণ করেছেন, কারফিউর জন্য কাজ করতে পারেননি-শিল্প মালিকরা তাদের পুরো বেতন দিয়ে দেবেন।
সরকারী কর্মচারীদের বলি, আমি যা বলি তা মানতে হবে। কাউকে যেন অফিসে দেখা না যায়। 
এ দেশের মুক্তি না হওয়া পর্যন্ত খাজনা-ট্যাক্স বন্ধ থাকবে। আপনারা আমার উপর ছেড়ে দেন, আন্দোলন কিভাবে করতে হয় আমি জানি।
কিন্তু হুঁশিয়ার, একটা কথা মনে রাখবেন, আমাদের মধ্যে শত্রু ঢুকেছে, ছদ্মবেশে তারা আত্মকহলের সৃষ্টি করতে চায়। 
বাঙ্গালী-অবাঙ্গালী, হিন্দু-মুসলমান সবাই আমাদের ভাই, তাদের রক্ষা করার দায়িত্ব আমাদের।
রেডিও, টেলিভিশন ও সংবাদপত্র যদি আমাদের আন্দোলনের খবর প্রচার না করে তবে কোন বাঙ্গালী রেডিও এবং টেলিভিশনে যাবেন না।
শান্তিপূর্ণভাবে ফয়সালা করতে পারলে ভাই ভাই হিসাবে বাস করার সম্ভাবনা আছে, তা না হলে নেই। বাড়াবাড়ি করবেন না, মুখ দেখাদেখিও বন্ধ হয়ে যেতে পারে।
প্রস্তুত থাকবেন, ঠাণ্ডা হলে চলবে না। আন্দোলন ও বিক্ষোভ চালিয়ে যাবেন। 
আন্দোলন ঝিমিয়ে পড়লে তারা আমাদের উপর ঝাঁপিয়ে পড়বে। শৃংখলা বজায় রাখুন। শৃংখলা ছাড়া কোন জাতি সংগ্রামে জয়লাভ করতে পারে না।
আমার অনুরোধ প্রত্যেক গ্রামে, মহল্লায়, ইউনিয়নে, আওয়ামী লীগের নেতৃত্বে সংগ্রাম কমিটি গড়ে তুলুন। হাতে যা আছে তাই নিয়ে প্রস্তুত থাকুন। 
রক্ত যখন দিয়েছি, রক্ত আরও দেবো। এদেশের মানুষকে মুক্ত করে ছাড়বো ইনশাল্লাহ।
এবারের সংগ্রাম, মুক্তির সংগ্রাম, এবারের সংগ্রাম, স্বাধীনতার সংগ্রাম।
জয় বাংলা। ";

	// Here we split it into lines.
	$speech = explode( "\n", $speech );

	// And then randomly choose a line.
	return wptexturize( $speech[ mt_rand( 0, count( $speech ) - 1 ) ] );
}

// This just echoes the chosen line, we'll position it later.
function Bangabandhu() {
	$chosen = Bangabandhu_get_7th_March_speech();
	$lang   = '';
	if ( 'en_' !== substr( get_user_locale(), 0, 3 ) ) {
		$lang = ' lang="en"';
	}

	printf(
		'<p id="Mujib"><span class="screen-reader-text">%s </span><span dir="ltr"%s>%s</span></p>',
		__( 'Quote from 7 March Speech of Bangabandhu:', 'Bangabandhu' ),
		$lang,
		$chosen
	);
}

// Now we set that function up to execute when the admin_notices action is called.
add_action( 'admin_notices', 'Bangabandhu' );

// We need some CSS to position the paragraph.
function Mujib_css() {
	echo "
	<style type='text/css'>
	#Mujib {
		float: right;
		padding: 5px 10px;
		margin: 0;
		font-size: 12px;
		line-height: 1.6666;
	}
	.rtl #Mujib {
		float: left;
	}
	.block-editor-page #Mujib {
		display: none;
	}
	@media screen and (max-width: 782px) {
		#Mujib,
		.rtl #Mujib {
			float: none;
			padding-left: 0;
			padding-right: 0;
		}
	}
	</style>
	";
}

add_action( 'admin_head', 'Mujib_css' );
